<?php

namespace Database\Factories;

use Illuminate\Database\Eloquent\Factories\Factory;
use App\Models\Agenda;

/**
 * @extends \Illuminate\Database\Eloquent\Factories\Factory<\App\Models\Agenda>
 */
class AgendaFactory extends Factory
{

    protected $model = Agenda::class;

    /**
     * Define the model's default state.
     *
     * @return array<string, mixed>
     */
    public function definition(): array
    {
        return [
            'name' => 'Multiple Day Conference Agenda',
            'days' => [
                [
                    'date' => 'Ден 1',
                    'sections' => [
                        [
                            'hour' => '10:00',
                            'title' => 'Регистрација и утринско кафе',
                            'subtitle' => [
                                'Пристигнување и неформално запознавање меѓу учесниците.',
                            ]
                        ],
                        [
                            'hour' => '10:30',
                            'title' => 'Вовед и отворање на настанот',
                            'subtitle' => [
                                'Поздравен говор од организаторот',
                                'Кратко претставување на агендата.'
                            ]
                        ],
                        [
                            'hour' => '11:00',
                            'title' => 'Презентација: Важноста на соработката меѓу HR одделот и синдикатот',
                            'subtitle' => [
                                'Презентер: Елица Перчиновик',
                                'Значењето на заедничката работа, придобивки и потенцијални проблеми.'
                            ]
                        ],
                        [
                            'hour' => '11:45',
                            'title' => 'Панел дискусија: Искусувања и предизвици во праксата',
                            'subtitle' => [
                                'Модератор: Ѓоко Вукановски',
                                'Панелисти: Претставници од HR и синдикатот од различни индустрии.'
                            ]
                        ],
                        [
                            'hour' => '12:30',
                            'title' => 'Пауза за кафе и неформални разговори',
                            'subtitle' => []
                        ],
                        [
                            'hour' => '13:00',
                            'title' => 'Работилница: Стратегии за подобрување на соработката',
                            'subtitle' => [
                                'Водител: Зорица Поповска',
                                'Практични совети и техники за подобрување на комуникацијата и соработката.'
                            ]
                        ],
                        [
                            'hour' => '14:00',
                            'title' => 'Клучни алатки и методи за успешна соработка',
                            'subtitle' => [
                                'Презентер: Марија Петрушевска',
                                'Презентација на алатки и методи кои можат да се применат веднаш.'
                            ]
                        ],
                        [
                            'hour' => '14:45',
                            'title' => 'Завршни зборови и заклучоци',
                            'subtitle' => [
                                'Сумирање на клучните поенти од настанот',
                                'Дискусија за понатамошни чекори.'
                            ]
                        ],
                        [
                            'hour' => '15:00',
                            'title' => 'Мрежно поврзување и неформално завршување на настанот',
                            'subtitle' => [
                                'Мрежност за неформални разговори и размена на контакти.'
                            ]
                        ],
                    ],
                ],
                [
                    'date' => 'Ден 2',
                    'sections' => [
                        [
                            'hour' => '10:00',
                            'title' => 'Регистрација и утринско кафе',
                            'subtitle' => [
                                'Пристигнување и неформално запознавање меѓу учесниците.',
                            ]
                        ],
                        [
                            'hour' => '10:30',
                            'title' => 'Вовед и отворање на настанот',
                            'subtitle' => [
                                'Поздравен говор од организаторот',
                                'Кратко претставување на агендата.'
                            ]
                        ],
                        [
                            'hour' => '11:00',
                            'title' => 'Презентација: Важноста на соработката меѓу HR одделот и синдикатот',
                            'subtitle' => [
                                'Презентер: Елица Перчиновик',
                                'Значењето на заедничката работа, придобивки и потенцијални проблеми.'
                            ]
                        ],
                        [
                            'hour' => '11:45',
                            'title' => 'Панел дискусија: Искусувања и предизвици во праксата',
                            'subtitle' => [
                                'Модератор: Ѓоко Вукановски',
                                'Панелисти: Претставници од HR и синдикатот од различни индустрии.'
                            ]
                        ],
                        [
                            'hour' => '12:30',
                            'title' => 'Пауза за кафе и неформални разговори',
                            'subtitle' => []
                        ],
                    ],
                ],
            ],
        ];
    }

    public function oneDayAgenda(): Factory 
    {
        return $this->state(function (array $attributes) {
            return [
                'name' => 'One Day Event Agenda',
                'days' => [
                    [
                        'date' => '25 Јули 2024',
                        'sections' => [
                            [
                                'hour' => '10:00',
                                'title' => 'Регистрација и утринско кафе',
                                'subtitle' => [
                                    'Пристигнување и неформално запознавање меѓу учесниците.',
                                ]
                            ],
                            [
                                'hour' => '10:30',
                                'title' => 'Вовед и отворање на настанот',
                                'subtitle' => [
                                    'Поздравен говор од организаторот',
                                    'Кратко претставување на агендата.'
                                ]
                            ],
                            [
                                'hour' => '11:00',
                                'title' => 'Презентација: Важноста на соработката меѓу HR одделот и синдикатот',
                                'subtitle' => [
                                    'Презентер: Елица Перчиновик',
                                    'Значењето на заедничката работа, придобивки и потенцијални проблеми.'
                                ]
                            ],
                            [
                                'hour' => '11:45',
                                'title' => 'Панел дискусија: Искусувања и предизвици во праксата',
                                'subtitle' => [
                                    'Модератор: Ѓоко Вукановски',
                                    'Панелисти: Претставници од HR и синдикатот од различни индустрии.'
                                ]
                            ],
                            [
                                'hour' => '12:30',
                                'title' => 'Пауза за кафе и неформални разговори',
                                'subtitle' => []
                            ],
                            [
                                'hour' => '13:00',
                                'title' => 'Работилница: Стратегии за подобрување на соработката',
                                'subtitle' => [
                                    'Водител: Зорица Поповска',
                                    'Практични совети и техники за подобрување на комуникацијата и соработката.'
                                ]
                            ],
                            [
                                'hour' => '14:00',
                                'title' => 'Клучни алатки и методи за успешна соработка',
                                'subtitle' => [
                                    'Презентер: Марија Петрушевска',
                                    'Презентација на алатки и методи кои можат да се применат веднаш.'
                                ]
                            ],
                            [
                                'hour' => '14:45',
                                'title' => 'Завршни зборови и заклучоци',
                                'subtitle' => [
                                    'Сумирање на клучните поенти од настанот',
                                    'Дискусија за понатамошни чекори.'
                                ]
                            ],
                            [
                                'hour' => '15:00',
                                'title' => 'Мрежно поврзување и неформално завршување на настанот',
                                'subtitle' => [
                                    'Мрежност за неформални разговори и размена на контакти.'
                                ]
                            ],
                        ],
                    ],
                ],
            ];
        });
    }
}
