<?php

namespace Database\Factories;

use Illuminate\Database\Eloquent\Factories\Factory;

/**
 * @extends \Illuminate\Database\Eloquent\Factories\Factory<\App\Models\Blog>
 */
class BlogFactory extends Factory
{
    /**
     * Define the model's default state.
     *
     * @return array<string, mixed>
     */
    public function definition(): array
    {
        return [
            'photo_path' => $this->faker->imageUrl(360, 360, 'events', true),
            'title' => 'Како до најдобар избор при  процесот на регрутација',
            'description' => 'Процесот на регрутација е клучен за успехот на секоја организација. Селекцијата на вистинските кандидати може значително да влијае на продуктивноста, културата и развојот на компанијата. Следните чекори и совети ќе ви помогнат да направите најдобар избор при регрутацијата.',
            'sections' => json_encode([
                [
                    'section_title' => 'Прецизно дефинирање на позицијата',
                    'section_body' => 'Првиот чекор кон успешна регрутација е јасно дефинирање на позицијата. Ова вклучува детално опишување на задачите, одговорностите и потребните квалификации. Кога огласот за работа е прецизен, ќе привлечете кандидати кои се вистински заинтересирани и квалификувани за позицијата.'
                ],
                [
                    'section_title' => 'Развивање на ефикасна стратегија за привлекување кандидати',
                    'section_body' => 'Откако ќе го дефинирате профилот на идеалниот кандидат, потребно е да развиете стратегија за привлекување на такви кандидати. Ова може да вклучува користење на различни канали за регрутација, како што се огласни табли, социјални медиуми и професионални мрежи.'
                ],
                [
                    'section_title' => 'Спроведување на структуриран процес на интервју',
                    'section_body' => 'Структурираниот процес на интервју е од суштинско значење за објективна и фер селекција. Ова вклучува подготовка на прашања кои се релевантни за позицијата и кои ќе ви помогнат да ја процените способноста на кандидатите да ги исполнат барањата на работата.'
                ],
                [
                    'section_title' => 'Вклучување на релевантни тестови и проценки',
                    'section_body' => 'Тестовите и проценките можат да бидат од голема помош при проценката на вештините и компетенциите на кандидатите. Ова може да вклучува тестови за технички вештини, психометриски тестови или проценки на личноста.'
                ],
                [
                    'section_title' => 'Донесување на информирана одлука',
                    'section_body' => 'Последниот чекор е донесувањето на информирана одлука. Ова подразбира анализа на сите информации собрани за време на процесот на регрутација, вклучувајќи го интервјуто, резултатите од тестовите и препораките.'
                ],
                [
                    'section_title' => 'Заклучок',
                    'section_body' => 'Регрутацијата е комплексен процес кој бара внимателно планирање и имплементација. Преку прецизно дефинирање на позицијата, развивање на ефикасна стратегија за привлекување кандидати, спроведување на структуриран процес на интервју, вклучување на релевантни тестови и проценки и донесување на информирана одлука, можете да осигурате дека ќе го направите најдобриот избор за вашата организација.'
                ],
            ]),
            'user_id' => null,
            'is_featured' => false
        ];
    }
}
