<?php

namespace Database\Factories;

use Illuminate\Database\Eloquent\Factories\Factory;

/**
 * @extends \Illuminate\Database\Eloquent\Factories\Factory<\App\Models\Event>
 */
class EventFactory extends Factory
{
    /**
     * Define the model's default state.
     *
     * @return array<string, mixed>
     */
    public function definition(): array
    {
        return [
            'title' => 'HR Кафе',
            'theme' => '„ПОТРЕБАТА ОД ЗАЈАКНУВАЊЕ НА СОРАБОТКАТА ПОМЕЃУ HR ОДДЕЛОТ И ПРЕТСТАВНИКОТ НА ВРАБОТЕНИТЕ (СИНДИКАТОТ), СО ЦЕЛ УНАПРЕДУВАЊЕ НА РАБОТНАТА ОРГАНИЗАЦИЈА“',
            'description' => 'Овој настан има за цел да ја истакне важноста од тесната соработка меѓу HR одделот и претставникот на вработените (синдикатот) во организациите. Преку овој настан ќе ги разгледаме најдобрите практики, предизвиците и можностите кои се јавуваат при заедничката работа на овие две страни, со цел подобрување на работната атмосфера и организациската ефикасност. Учесниците ќе имаат можност да слушнат од експерти во областа, да дискутираат за своите искуства и да пронајдат нови начини за унапредување на соработката.',
            'objective' => 'Целта на овој HR кафе настан е да се создаде платформа за отворена комуникација и размена на идеи која ќе придонесе за подобра соработка меѓу HR одделот и синдикатот, што ќе резултира со позитивни промени во работната организација.',
            'location' => 'Скопје, Северна Македонија',
            'date' => '2024-12-10',
            'ticket_prices' => json_encode([
                [
                    'type' => 'Поединец',
                    'price' => '500',
                ],
                [
                    'type' => 'Бизнис',
                    'price' => '5000',
                ]
            ]),
            'agenda_id' => null,
            'is_featured' => false,
            'photo_path' => $this->faker->imageUrl(640, 480, 'events', true),
        ];
    }
}
